atmosphere/tutorials/ce1/T200_AMR_newVersion/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   /*dynamicMultiDimRefineBalancedFvMesh;*/ dynamicMultiDimRefineFvMesh;

//enableBalancing true;
//allowableImbalance 0.10;

adaptCriteria
{
    type fieldBounds;
    fieldName alpha;
    lowerBound 0.1;
    upperBound 0.9;
    nLayer 2;
}

// How often to refine
refineInterval 1;

// Have slower than 2:1 refinement
nBufferLayers   1;

// Refine cells only up to maxRefinement levels
maxRefinement   1;

// Stop refinement if maxCells reached
maxCells        200000;

// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.
// Fluxes to adapt. For newly created faces or split faces the flux
// gets estimated from an interpolated volVectorField ('velocity')
// First is name of the flux to adapt, second is velocity that will
// be interpolated and inner-producted with the face area vector.

// I FLUSSI DA SISTEMARE SONO TUTTI surfaceScalarField

correctFluxes
(
    (phi none)
    (nHatf none)
    (rhoPhi none) 
    (alphaPhi0.water none)
    (alphaPhi0 none)
    (alphaPhiUn none)
    (ghf none)
    (phi0 none)
    (dVf_ none)
);


// Write the refinement level as a volScalarField
dumpLevel       true;





// ************************************************************************* //

