atmosphere/tutorials/ce1/T200_AMR_newVersion/0/ph_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
4096
(
1579.97
1578.08
1574.36
1568.87
1561.77
1553.19
1543.35
1532.43
...
)
;

boundaryField
{
    top
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
128
(
-4.24178
-4.2419
-4.24212
-4.24246
-4.2429
-4.24343
-4.24404
-4.24472
...
)
;
        value           nonuniform List<scalar> 
128
(
-14424.5
-14422.1
-14417.5
-14410.7
-14401.9
-14391.2
-14378.9
-14365.1
...
)
;
    }
    bottom
    {
        type            fixedFluxPressure;
        gradient        uniform -0;
        value           nonuniform List<scalar> 
128
(
1579.97
1578.08
1574.36
1568.87
1561.77
1553.19
1543.35
1532.43
...
)
;
    }
    left
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
32
(
1579.97
1544.86
1475.48
1372.72
1237.52
1074.24
908.23
749.285
...
)
;
    }
    right
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
32
(
1291.16
1254.23
1181.09
1072.46
929.037
751.534
540.652
297.09
...
)
;
    }
    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
