atmosphere/tutorials/ce1/T200_AMR_newVersion/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default        Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss cubic; //linear; //upwind;
    div(phi,U)      Gauss cubic; //linear; //upwind;
    div(phi,h)      Gauss cubic; //linear; // upwind;
    div(phi,e)      Gauss cubic; //linear; //upwind;
    div(phi,k)      Gauss cubic; //linear; //upwind;
    div(phi,epsilon) Gauss cubic; //linear; //upwind;
    div(phi,R)      Gauss cubic; //linear; //upwind;
    div(phi,K)      Gauss cubic; //linear;
    div(phi,Ekp)    Gauss cubic; //linear;
    div(R)          Gauss cubic; //linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss cubic; //linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
